# Titanic

* Data from Kaggle
* Tutorial based on Udemy

In [2]:
import pandas as pd
from pandas import Series, DataFrame

titanic_df = pd.read_csv('train.csv')

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

## Questions:
1. Who were the passengers on the Titanic? (Ages, Gender, Class, etc)
2. What deck were the passengers on and how does that relate to their class?
3. Where did the passengers come from?
4. Who was alone and who was with family?
5. What factors helped someone survive the sinking?

### 1. Who were the passengers on the titanic?

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

:

In [1]:
# First check gender
sns.histplot(x='Sex',data=titanic_df)

NameError: name 'sns' is not defined

In [ ]:
# Separate the genders by classes using 'hue' argument
sns.histplot(x='Pclass',data=titanic_df,hue='Sex')

In [ ]:
# Now splot between males, females, and children

def child(passenger):
    age, sex = passenger
    if age < 16:
        return 'child'
    else:
        return sex

# Define a new column 'person'
titanic_df['person'] = titanic_df[['Age','Sex']].apply(child,axis=1)

In [ ]:
# See if it worked, check out the first ten rows
titanic_df[0:10]

In [ ]:
sns.histplot(x='Pclass',data=titanic_df,hue='person')

In [ ]:
# Create a distribution of the ages
titanic_df['Age'].hist(bins=70)
# OR sns.histplot(x='Age',data=titanic_df,bins=70)

In [ ]:
# Get a quick overall comparison of male, female, child
titanic_df['person'].value_counts()

In [ ]:
# Visualize the data using FacetGrid, plotting multiple kedplots on one plot

fig = sns.FacetGrid(titanic_df, hue='Sex', aspect = 4)
fig.map(sns.kdeplot, 'Age', fill=True)
oldest = titanic_df['Age'].max()
fig.set(xlim=(0,oldest))
fig.add_legend()